package com.example.kiosk

//Lv0[필요 기능]
//요구사항1: 메인 메뉴판 화면
//: 메뉴 선택시 상세 메뉴화면으로 이동
//: 잘못된 번호 선택 시 예외처리
//: 프로그램 종료을 위한 번호 정의

//📢 **Lv1 구현을 위해서는 `조건`과 `반복`의 개념을 알고 있어야 합니다!**

//- 프로그램을 실행하면 메뉴판의 번호들을 보여줍니다.(대분류의 메뉴를 보여줌)
//- 대분류 메뉴에 해당하는 숫자를 입력하면 선택하면 세부 메뉴들을 보여줍니다.
//- 예를 들어 햄버거에 해당하는 숫자를 입력 하면
//햄버거 1, 햄버거 2 처럼 세부 종류를 보여줘요.(출력 예시 참고)
//- **`반복문`**을 이용해서 메뉴 선택할 수 있게 유지하고
//대분류 메뉴에서, 0번이 입력되면 프로그램을 종료합니다.

//📢 **Lv2 구현을 위해서는 `메소드`와 `클래스`의 개념을 알고 있어야 합니다!**

//- 필요한 클래스들을 설계합니다.(버거, 아이스크림, 음료, 맥주, 주문, 공통 등)
//- 클래스들의 **`프로퍼티`**와 **`메소드`**를 정의합니다
//- 예를 들어 아래 이미지처럼 클래스 다이어그램을 그려봅시다.
//- 햄버거는 이름, 가격 같은 프로퍼티와 정보를 출력하는 메소드가 있을 수 있죠?
//- **`Lv1`**에서 작성한 로직을 메소드로 만듭니다.
